import sqlite3
import pandas as pd
from passlib.context import CryptContext

# PRAGMA FOREIGN_KEYS = on;


con = sqlite3.connect("VKR.sqlite")

con.executescript('''

CREATE TABLE IF NOT EXISTS users(
    user_id INTEGER PRIMARY KEY AUTOINCREMENT,
    user_login VARCHAR(20) NOT NULL,
    user_password VARCHAR(30) NOT NULL,
    user_email VARCHAR(30) NOT NULL,
    user_surname VARCHAR(20),
    user_name VARCHAR(20),
    user_fathername VARCHAR(20),
    user_age INTEGER,
    user_is_female INTEGER,
    user_is_admin VARCHAR(1),
    user_picture_id INTEGER
 );

CREATE TABLE IF NOT EXISTS territories(
    territorie_id INTEGER PRIMARY KEY AUTOINCREMENT,
    territorie_landscape_id INTEGER,
    territorie_description VARCHAR,
    territorie_color_r INTEGER,
    territorie_color_g INTEGER,
    territorie_color_b INTEGER
 );
 
 
CREATE TABLE IF NOT EXISTS coords(
    coords_id INTEGER PRIMARY KEY AUTOINCREMENT,
    coords_coord_x REAL NOT NULL,
    coords_coord_y REAL NOT NULL,
    coords_territorie_id INTEGER NOT NULL,
    coords_order INTEGER NOT NULL
 );
 
 
CREATE TABLE IF NOT EXISTS landscapes(
    landscape_id INTEGER PRIMARY KEY AUTOINCREMENT,
    landscape_name VARCHAR(100) NOT NULL,
    landscape_code VARCHAR(100),
    landscape_description VARCHAR,
    landscape_area_in_square_kilometers REAL,
    landscape_area_in_percents REAL,
    landscape_KR REAL,
    landscape_picture_id INTEGER
 ); 
 
 
CREATE TABLE IF NOT EXISTS soils(
    soil_id INTEGER PRIMARY KEY AUTOINCREMENT,
    soil_name VARCHAR(100) NOT NULL,
    soil_description VARCHAR,
    soil_acidity REAL,
    soil_minerals VARCHAR(100),
    soil_profile VARCHAR(100),
    soil_picture_id INTEGER
 );
 
 
CREATE TABLE IF NOT EXISTS grounds(
    ground_id INTEGER PRIMARY KEY AUTOINCREMENT,
    ground_name VARCHAR(100) NOT NULL,
    ground_description VARCHAR,
    ground_density REAL,
    ground_humidity REAL,
    ground_solidity REAL,
    ground_picture_id INTEGER
 );
 
 
CREATE TABLE IF NOT EXISTS plants(
    plant_id INTEGER PRIMARY KEY AUTOINCREMENT,
    plant_name VARCHAR(100) NOT NULL,
    plant_description VARCHAR,
    plant_picture_id INTEGER
 );
 
 
CREATE TABLE IF NOT EXISTS reliefs(
    relief_id INTEGER PRIMARY KEY AUTOINCREMENT,
    relief_name VARCHAR(100) NOT NULL,
    relief_description VARCHAR,
    relief_picture_id INTEGER
 ); 
 
  
CREATE TABLE IF NOT EXISTS foundations(
    foundation_id INTEGER PRIMARY KEY AUTOINCREMENT,
    foundation_name VARCHAR(100) NOT NULL,
    foundation_description VARCHAR,
    foundation_depth_roof_root_in_meters REAL,
    foundation_picture_id INTEGER
 ); 
  
 
CREATE TABLE IF NOT EXISTS waters(
    water_id INTEGER PRIMARY KEY AUTOINCREMENT,
    water_name VARCHAR(100) NOT NULL,
    water_description VARCHAR,
    water_picture_id INTEGER
 );
 
 
CREATE TABLE IF NOT EXISTS climats(
    climat_id INTEGER PRIMARY KEY AUTOINCREMENT,
    climat_name VARCHAR(100) NOT NULL,
    climat_description VARCHAR,
    climat_picture_id INTEGER
 ); 

   
CREATE TABLE IF NOT EXISTS pictures(
    picture_id INTEGER PRIMARY KEY AUTOINCREMENT,
    picture_base64 VARCHAR NOT NULL
 );


CREATE TABLE IF NOT EXISTS connections_landscapes_soils(
    connection_id INTEGER PRIMARY KEY AUTOINCREMENT,
    landscape_id INTEGER NOT NULL,
    soil_id INTEGER NOT NULL
 );
 
CREATE TABLE IF NOT EXISTS connections_landscapes_grounds(
    connection_id INTEGER PRIMARY KEY AUTOINCREMENT,
    landscape_id INTEGER NOT NULL,
    ground_id INTEGER NOT NULL
 );
 
CREATE TABLE IF NOT EXISTS connections_landscapes_plants(
    connection_id INTEGER PRIMARY KEY AUTOINCREMENT,
    landscape_id INTEGER NOT NULL,
    plant_id INTEGER NOT NULL
 );
 
CREATE TABLE IF NOT EXISTS connections_landscapes_reliefs(
    connection_id INTEGER PRIMARY KEY AUTOINCREMENT,
    landscape_id INTEGER NOT NULL,
    relief_id INTEGER NOT NULL
 );

CREATE TABLE IF NOT EXISTS connections_landscapes_foundations(
    connection_id INTEGER PRIMARY KEY AUTOINCREMENT,
    landscape_id INTEGER NOT NULL,
    foundation_id INTEGER NOT NULL
 );
 
CREATE TABLE IF NOT EXISTS connections_landscapes_waters(
    connection_id INTEGER PRIMARY KEY AUTOINCREMENT,
    landscape_id INTEGER NOT NULL,
    water_id INTEGER NOT NULL
 );
 
CREATE TABLE IF NOT EXISTS connections_landscapes_climats(
    connection_id INTEGER PRIMARY KEY AUTOINCREMENT,
    landscape_id INTEGER NOT NULL,
    climat_id INTEGER NOT NULL
 );

 
 
 

INSERT INTO users (user_login, user_password, user_email, user_surname, user_name, user_fathername, user_age, user_is_female, user_is_admin, user_picture_id)
VALUES
('root', '$2b$12$lmgd4.BgpQr8w76p5Kcpueis4yNWLqpmxXinAr62yKqLrwsvO5cKu', 'superadmin@yandex.ru', 'Иванов', 'Пётр', 'Сидорович', 23, 0, 'true', 1), 
('vanek2002', '$2b$12$xnDJi2tMww9CtJ9Iv3571.CiAq47eEajCt6KfeYdqPqyHU0Avo1dW', 'vanya@yandex.ru', 'Иванов', 'Иван', 'Иванович', 32, 0, null, 2), 
('petrpervuy', '$2b$12$xnDJi2tMww9CtJ9Iv3571.CiAq47eEajCt6KfeYdqPqyHU0Avo1dW', 'petrpervuy@gmail.com', 'Петров', 'Пётр', 'Петрович', 19, 0, null, 3),  
('mashapupkina', '$2b$12$xnDJi2tMww9CtJ9Iv3571.CiAq47eEajCt6KfeYdqPqyHU0Avo1dW', 'pupkinama@gmail.com', 'Пупкина', 'Мария', 'Игоревна', 24, 1, null, 4),
('lutiysidor', '$2b$12$xnDJi2tMww9CtJ9Iv3571.CiAq47eEajCt6KfeYdqPqyHU0Avo1dW', 'supersid@mail.ru', 'Сидоров', 'Сидор', 'Сидорович', 25, 0, 'true', 5),  
('q', '$2b$12$xDg2cp6GCE4AMEj4v43OxuHHafs.Ng4VFqcnwF3nmdPBXLf5ln7E6', 'q@mail.ru', 'Иванов', 'Пётр', 'Сидорович', 28, 0, 'true', 6); 

INSERT INTO territories (territorie_landscape_id, territorie_description, territorie_color_r, territorie_color_g, territorie_color_b)
VALUES
(1, 'Территория возле Владивостока', 134, 68, 198),
(2, 'Ещё одна территория возле Владивостока', 159, 217, 36);

INSERT INTO coords (coords_coord_x, coords_coord_y, coords_territorie_id, coords_order)
VALUES
(43.1266, 131.9217, 1, 1),
(43.1089, 131.9449, 1, 2),
(43.1290, 131.9967, 1, 3),
(43.1618, 131.9758, 1, 4),
(43.1412, 131.9045, 1, 5),
(43.1445, 132.0192, 2, 1),
(43.1838, 131.9725, 2, 2),
(43.1849, 132.0570, 2, 3);

-- Ландшафты
INSERT INTO landscapes (landscape_id, landscape_name, landscape_code, landscape_description, landscape_area_in_square_kilometers, landscape_area_in_percents, landscape_KR)
VALUES
(1, 'Ландшафт 1-1', '1-1', 'Расположен на среднегорной вершине водораздела на правобережье среднего течения реки Самарга.', 5.3, 0.9, 1.2),
(2, 'Ландшафт 1-2', '1-2', 'Расположен на среднегорной вершине на правобережье среднего течения реки Самарга.', 4.8, 0.8, 1.0),
(3, 'Ландшафт 1-3', '1-3', 'Расположен на водоразделе правобережья реки Самарга, западнее поселка Агзу.', 22.0, 3.6, 1.3),
(4, 'Ландшафт 1-4', '1-4', 'Расположен на водоразделе правобережья среднего течения реки Самарга, район г. Сахатка с отм. 1464 м.', 25.5, 4.2, 1.4),
(5, 'Ландшафт 1-5', '1-5', 'Расположен на водораздельной гриве среднего течения рек Самарга и Единка, вытянут в северо-западном направлении.', 43.6, 7.3, 1.8),
(6, 'Ландшафт 1-6', '1-6', 'Расположен на правобережье верховья реки Бикин, в приводораздельной части с рекой Единка, юго-западнее г. Голец с отм. 1668 м.', 44.4, 7.3, 1.7),
(7, 'Ландшафт 1-7', '1-7', 'Расположен на водораздельной части бассейнов рек Кабанья и Единка.', 33.3, 5.5, 1.9),
(8, 'Ландшафт 1-8', '1-8', 'Расположен на левобережье р. Ключевая, правого притока верховья р. Бикин, район г. Сухопадная с отм. 1746 м.', 18.4, 3.1, 1.4),
(9, 'Ландшафт 1-9', '1-9', 'Расположен на водоразделе рек Бол. Пея и Кобанья, юго-восточнее г. Водораздельная с отм. 1575 м.', 24.3, 4.0, 1.4),
(10, 'Ландшафт 1-10', '1-10', 'Расположен на водоразделе нижнего течения рек Кобанья и Пея.', 13.5, 2.2, 1.6),
(11, 'Ландшафт 1-11', '1-11', 'Расположен на водоразделе верхнего течения р. Дальняя и левых притоков р. Бикин, западнее г. Широкая с отм. 1505 метров.', 3.6, 0.6, 1.2),
(12, 'Ландшафт 1-12', '1-12', 'Расположен на водоразделе верховья р. Дальняя и р. Бикин в районе г. Широкая с отм. 1505 метров.', 6.1, 1.0, 1.4),
(13, 'Ландшафт 1-13', '1-13', 'Расположен на водоразделе верховья р. Арму и р. Бикин восточнее г. Широкая с отм. 1505 м.', 7.7, 1.3, 1.1),
(14, 'Ландшафт 1-14', '1-14', 'Расположен на водоразделе правых притоков верховья р. Дальняя и левых притоков р. Бикин в районе пос. Красный Яр, северо-восточнее г. Предок с отм. 1401 м.', 4.8, 0.8, 1.1),
(15, 'Ландшафт 1-15', '1-15', 'Расположен на водоразделе верховьев рек Дальняя и Арму, район г. Широкая с отм. 1505 м.', 7.1, 1.2, 1.6),
(16, 'Ландшафт 1-16', '1-16', 'Расположен на водоразделе верховья р. Арму и левых притоков р. Бикин, севернее г. Широкая с отм. 1505 м.', 3.6, 0.6, 1.2),
(17, 'Ландшафт 1-17', '1-17', 'Расположен на водораздельной гриве правых притоков верховья р. Дальняя и левых притоков р. Бикин в районе п. Красный Яр и района г. Предок с отм. 1401 м.', 5.6, 0.9, 1.3),
(18, 'Ландшафт 1-18', '1-18', 'Расположен на водоразделе бассейна верховья р. Дальняя, восточнее г. Широкая с отм. 1505 м.', 3.8, 0.6, 1.3),
(19, 'Ландшафт 1-19', '1-19', 'Расположен на водораздельной гриве бассейна верховья р. Дальняя.', 6.4, 1.1, 1.1),
(20, 'Ландшафт 1-20', '1-20', 'Расположен на водораздельной гриве левобережья в верховье р. Арму.', 5.4, 0.9, 1.2),
(21, 'Ландшафт 1-21', '1-21', 'Расположен на водораздельной гриве верховья р. Дальняя.', 8.4, 1.4, 1.8),
(22, 'Ландшафт 1-22', '1-22', 'Расположен на вершине водораздельной гривы бассейна левых притоков верховья р. Дальняя.', 5.2, 0.9, 1.1),
(23, 'Ландшафт 1-23', '1-23', 'Расположен на вершине водораздельной гривы рек Кемы и Бикин.', 3.4, 0.6, 1.2),
(24, 'Ландшафт 1-24', '1-24', 'Расположен на вершине водораздельной гривы бассейна верховьев рек Арму и Дальняя.', 4.4, 0.7, 1.1),
(25, 'Ландшафт 1-25', '1-25', 'Расположен на вершинах водораздела рек Арму и Кема.', 13.6, 2.2, 1.6),
(26, 'Ландшафт 1-26', '1-26', 'Расположен на вершине водораздельной гривы верховья бассейнов рек Кема и Светловодная.', 4.5, 0.8, 1.3),
(27, 'Ландшафт 1-27', '1-27', 'Расположен на вершине водораздельной гривы верховья бассейнов рек Кема и Светловодная.', 7.0, 1.2, 1.6),
(28, 'Ландшафт 1-28', '1-28', 'Расположен на вершине водораздельной гривы верховья бассейнов рек Кема и Светловодная.', 6.5, 1.1, 1.2),
(29, 'Ландшафт 1-29', '1-29', 'Расположен на вершине водораздельной гривы верховья бассейнов рек Кема и Светловодная.', 7.7, 1.3, 1.6),
(30, 'Ландшафт 1-30', '1-30', 'Расположен на вершинах водораздела рек Арму и Дальняя.', 2.9, 0.5, 1.2),
(31, 'Ландшафт 1-31', '1-31', 'Расположен на водоразделе верховья р. Кема.', 5.8, 0.9, 1.4),
(32, 'Ландшафт 1-32', '1-32', 'Расположен на водоразделе верховья бассейнов рек Кема и Светловодная.', 11.0, 1.8, 1.5),
(33, 'Ландшафт 1-33', '1-33', 'Расположен на гриве бассейна верховья р. Арму.', 2.8, 0.5, 1.1),
(34, 'Ландшафт 1-34', '1-34', 'Расположен на гриве бассейна верховья р. Арму.', 6.4, 1.1, 1.5),
(35, 'Ландшафт 1-35', '1-35', 'Расположен на водоразделе бассейнов рек Арму, Кема и Светловодная.', 3.4, 0.6, 1.1),
(36, 'Ландшафт 1-36', '1-36', 'Расположен на водоразделе бассейнов рек Максимовка и Светловодная.', 7.0, 1.1, 1.2),
(37, 'Ландшафт 1-37', '1-37', 'Расположен на водоразделе верховья р. Кема.', 6.9, 1.1, 1.3),
(38, 'Ландшафт 1-38', '1-38', 'Расположен на водоразделе бассейна р. Кема.', 6.9, 1.1, 1.5),
(39, 'Ландшафт 1-39', '1-39', 'Расположен на водоразделе рек Арму и Дальняя.', 7.8, 1.3, 1.1),
(40, 'Ландшафт 1-40', '1-40', 'Расположен на водоразделе бассейна р. Кема.', 5.9, 1.3, 1.3),
(41, 'Ландшафт 1-41', '1-41', 'Расположен на водоразделе левых притоков верховья бассейна р. Кема.', 59.2, 9.7, 3.0),
(42, 'Ландшафт 1-42', '1-42', 'Расположен на водоразделе бассейнов рек Кема и Максимовка.', 28.6, 4.7, 1.4),
(43, 'Ландшафт 1-43', '1-43', 'Расположен на водоразделе верховья р. Максимовка в районе г. Курортная с отм. 1621 м.', 33.5, 5.5, 2.2),
(44, 'Ландшафт 1-44', '1-44', 'Расположен южнее г. Высокая с отм. 1745 м в верховье р. Кема.', 9.5, 1.6, 1.3),
(45, 'Ландшафт 1-45', '1-45', 'Расположен на водоразделе левых притоков верховья р. Максимовка юго-западнее г. Курортная с отм. 1621 м.', 3.1, 0.5, 1.2),
(46, 'Ландшафт 1-46', '1-46', 'Расположен на водоразделе рек Максимовка и Кема.', 5.3, 0.9, 1.3),
(47, 'Ландшафт 1-47', '1-47', 'Расположен на водоразделе рек Максимовка и Кема.', 3.9, 0.6, 1.1),
(48, 'Ландшафт 1-48', '1-48', 'Расположен южнее г. Курортная с отм. 1621 м на водоразделе рек Максимовка и Кема.', 8.1, 1.3, 1.5),
(49, 'Ландшафт 1-49', '1-49', 'Расположен на водоразделе левых притоков р. Кема.', 12.1, 1.6, 2.0),
(50, 'Ландшафт 1-50', '1-50', 'Расположен на водоразделе левых притоков нижнего течения р. Кема.', 10.0, 1.6, 1.2),
(51, 'Ландшафт 1-51', '1-51', 'Расположен севернее п. Мельничное на г. Арму с отм. 1330 м.', 5.0, 1.8, 1.1);

-- Грунты
INSERT INTO grounds (ground_id, ground_name) VALUES
(1, 'Горно-тундровый');

-- Растения
INSERT INTO plants (plant_id, plant_name) VALUES
(1, 'Лишайниково-кустарниковая');

-- Рельефы
INSERT INTO reliefs (relief_id, relief_name) VALUES
(1, 'Гольцовый среднегорный');

-- Фундаменты
INSERT INTO foundations (foundation_id, foundation_name, foundation_description, foundation_depth_roof_root_in_meters)
VALUES
(1, 'Верхнемезозойский комплекс эффузивных пород глубины 0.8м', 'С верхнемезозойским комплексом эффузивных пород (кислого состава).', 0.8),
(2, 'Верхнемезозойские граниты глубины 1.0м', 'С верхнемезозойскими гранитами.', 1.0),
(3, 'Верхнемезозойский комплекс эффузивных пород глубины 1.0м', 'С верхнемезозойским комплексом эффузивных пород (основного состава).', 1.0),
(4, 'Верхнемезозойский гетерогенный комплекс глубины 1.3м', 'С верхнемезозойским гетерогенным комплексом алевролитов и песчаников (северо-западная территория ландшафта), эффузивных пород основного состава (юго-восточная территория ландшафта) и прорывающих их позднемезозойско-раннепалеогеновых гранитоидов.', 1.3),
(5, 'Верхнемезозойский комплекс гранитов глубины 1.4м', 'С верхнемезозойским комплексом гранитов в северо-западной, эффузивных пород основного и кислого состава в юго-восточной и верхнемеловых алевролитов и песчаников в центральной частях ландшафта.', 1.4),
(6, 'Верхнемезозойский комплекс алевролитов и песчаников глубины 1.3м', 'С верхнемезозойским комплексом алевролитов и песчаников.', 1.3),
(7, 'Верхнемеловой алевролит-песчаниковый комплекс глубины 1.2м', 'С верхнемеловым алевролит-песчаниковым и прорывающим его верхнемеловым-палеогеновым гранитоидным комплексами.', 1.2),
(8, 'Верхнемеловой комплекс эффузивных пород глубины 1.0м', 'С верхнемеловым комплексом эффузивных пород кислого состава.', 1.0),
(9, 'Верхнемеловой комплекс гранитов глубины 1.3м', 'С верхнемеловым комплексом гранитов.', 1.3),
(10, 'Верхнемеловой комплекс гранитов глубины 1.0м', 'С верхнемеловым комплексом гранитов.', 1.0),
(11, 'Верхнемеловой комплекс гранитов глубины 1.2м', 'С верхнемеловым комплексом гранитов.', 1.2),
(12, 'Верхнемеловой комплекс гранитов глубины 1.3м', 'С верхнемеловым комплексом гранитов.', 1.3),
(13, 'Верхнемеловой комплекс гранитов глубины 1.0м', 'С верхнемеловым комплексом гранитов.', 1.0),
(14, 'Верхнемеловой комплекс гранитов глубины 1.2м', 'С верхнемеловым комплексом гранитов.', 1.2),
(15, 'Верхнемеловой комплекс гранитов глубины 1.3м', 'С верхнемеловым комплексом гранитов.', 1.3),
(16, 'Верхнемеловой комплекс гранитов глубины 1.0м', 'С верхнемеловым комплексом гранитов.', 1.0);

-- Воды
INSERT INTO waters (water_id, water_name) VALUES
(1, 'Водораздел на правобережье среднего течения реки Самарга'),
(2, 'Правобережье среднего течения реки Самарга'),
(3, 'Правобережье реки Самарга'),
(4, 'Правобережье верховья реки Бикин'),
(5, 'Бассейн рек Кабанья и Единка'),
(6, 'Левобережье р. Ключевая'),
(7, 'Водораздел рек Бол. Пея и Кобанья'),
(8, 'Нижнее течение рек Кобанья и Пея'),
(9, 'Верховье р. Дальняя'),
(10, 'Верховье р. Дальняя и р. Бикин'),
(11, 'Верховье р. Арму и р. Бикин'),
(12, 'Правобережье р. Бикин'),
(13, 'Бассейн рек Максимовка и Светловодная');

-- Связи для ландшафтов
INSERT INTO connections_landscapes_grounds (landscape_id, ground_id) VALUES
(1, 1), (2, 1), (3, 1), (4, 1), (5, 1), (6, 1), (7, 1), (8, 1), (9, 1), (10, 1),
(11, 1), (12, 1), (13, 1), (14, 1), (15, 1), (16, 1), (17, 1), (18, 1), (19, 1), (20, 1),
(21, 1), (22, 1), (23, 1), (24, 1), (25, 1), (26, 1), (27, 1), (28, 1), (29, 1), (30, 1),
(31, 1), (32, 1), (33, 1), (34, 1), (35, 1), (36, 1), (37, 1), (38, 1), (39, 1), (40, 1),
(41, 1), (42, 1), (43, 1), (44, 1), (45, 1), (46, 1), (47, 1), (48, 1), (49, 1), (50, 1),
(51, 1);

INSERT INTO connections_landscapes_plants (landscape_id, plant_id) VALUES
(1, 1), (2, 1), (3, 1), (4, 1), (5, 1), (6, 1), (7, 1), (8, 1), (9, 1), (10, 1),
(11, 1), (12, 1), (13, 1), (14, 1), (15, 1), (16, 1), (17, 1), (18, 1), (19, 1), (20, 1),
(21, 1), (22, 1), (23, 1), (24, 1), (25, 1), (26, 1), (27, 1), (28, 1), (29, 1), (30, 1),
(31, 1), (32, 1), (33, 1), (34, 1), (35, 1), (36, 1), (37, 1), (38, 1), (39, 1), (40, 1),
(41, 1), (42, 1), (43, 1), (44, 1), (45, 1), (46, 1), (47, 1), (48, 1), (49, 1), (50, 1),
(51, 1);

INSERT INTO connections_landscapes_reliefs (landscape_id, relief_id) VALUES
(1, 1), (2, 1), (3, 1), (4, 1), (5, 1), (6, 1), (7, 1), (8, 1), (9, 1), (10, 1),
(11, 1), (12, 1), (13, 1), (14, 1), (15, 1), (16, 1), (17, 1), (18, 1), (19, 1), (20, 1),
(21, 1), (22, 1), (23, 1), (24, 1), (25, 1), (26, 1), (27, 1), (28, 1), (29, 1), (30, 1),
(31, 1), (32, 1), (33, 1), (34, 1), (35, 1), (36, 1), (37, 1), (38, 1), (39, 1), (40, 1),
(41, 1), (42, 1), (43, 1), (44, 1), (45, 1), (46, 1), (47, 1), (48, 1), (49, 1), (50, 1),
(51, 1);

INSERT INTO connections_landscapes_foundations (landscape_id, foundation_id)
VALUES
(1, 1), (2, 2), (3, 3), (4, 4), (5, 5), (6, 2), (7, 6), (8, 7), (9, 8), (10, 9),
(11, 10), (12, 11), (13, 12), (14, 13), (15, 14), (16, 15), (17, 16), (18, 1), (19, 1), (20, 1),
(21, 9), (22, 9), (23, 10), (24, 11), (25, 12), (26, 13), (27, 14), (28, 15), (29, 16), (30, 10),
(31, 9), (32, 13), (33, 9), (34, 9), (35, 11), (36, 13), (37, 9), (38, 9), (39, 11), (40, 9),
(41, 9), (42, 13), (43, 9), (44, 9), (45, 11), (46, 13), (47, 13), (48, 13), (49, 9), (50, 9),
(51, 9);

INSERT INTO connections_landscapes_waters (landscape_id, water_id) VALUES
(1, 1), (2, 2), (3, 3), (4, 4), (5, 5), (6, 6), (7, 7), (8, 8), (9, 9), (10, 10),
(11, 9), (12, 10), (13, 11), (14, 12), (15, 11), (16, 11), (17, 11), (18, 1), (19, 1), (20, 11),
(21, 9), (22, 9), (23, 10), (24, 11), (25, 11), (26, 13), (27, 13), (28, 13), (29, 13), (30, 11),
(31, 9), (32, 13), (33, 9), (34, 9), (35, 11), (36, 13), (37, 9), (38, 9), (39, 11), (40, 9),
(41, 9), (42, 13), (43, 9), (44, 9), (45, 11), (46, 13), (47, 13), (48, 13), (49, 9), (50, 9),
(51, 9);


 ''')



con.commit()

# Настоящие (расшифрованные) пароли:
# Логин "root"           - Пароль "root"
# Логин "vanek2002"      - Пароль "123"
# Логин "petrpervuy"     - Пароль "123"
# Логин "mashapupkina"   - Пароль "123"
# Логин "lutiysidor"     - Пароль "123"
# Логин "q"              - Пароль "q"

cursor = con.cursor()